[{"id": 43, "title": "Backup file", "damage": 1, "reproducability": 1, "exploitability": 1, "affected_users": 1, "discoverability": 1, "dread_total": 5, "effort": null, "type": "Imported", "overview": "<paragraph>A common practice when administering web applications is to create a copy/backup of a particular file or directory prior to making any modification to the file. Another common practice is to add an extension or change the name of the original file to signify that it is a backup (examples include '.bak', '.orig', '.backup', etc.). During the initial recon stages of an attack, cyber-criminals will attempt to locate backup files by adding common extensions onto files already discovered on the webserver. By analysing the response headers from the server they are able to determine if the backup file exists. These backup files can then assist in the compromise of the web application.<paragraph></paragraph>By utilising the same method, the tool was able to discover a possible backup file.</paragraph>", "poc": null, "remediation": "<paragraph>Do not keep obsolete versions of files under the virtual web server root.<paragraph></paragraph>When updating the site, delete or move the files to a directory outside the virtual root, edit them there, and move (or copy) the files back to the virtual root. Make sure that only the files that are actually in use reside under the virtual root.<paragraph></paragraph>Preventing access without authentication may also be an option and stop a client being able to view the contents of a file, however it is still likely that the filenames will be able to be discovered.<paragraph></paragraph>Using obscure filenames is only implementing security through obscurity and is not a recommended option.</paragraph>", "references": "<paragraph>VulnDB: https://github.com/vulndb/data</paragraph><paragraph>http://www.webappsec.org/projects/threat/classes/information_leakage.shtml</paragraph>", "approved": true, "risk": 3, "affected_hosts": null, "av": null, "ac": null, "au": null, "c": null, "i": null, "a": null, "e": null, "rl": null, "rc": null, "cdp": null, "td": null, "cr": null, "ir": null, "ar": null, "cvss_base": null, "cvss_impact": null, "cvss_exploitability": null, "cvss_temporal": null, "cvss_environmental": null, "cvss_modified_impact": null, "cvss_total": null, "ease": null}]