[{"id": 77, "title": "Credit card number disclosure", "damage": 1, "reproducability": 1, "exploitability": 1, "affected_users": 1, "discoverability": 1, "dread_total": 5, "effort": null, "type": "Imported", "overview": "<paragraph>Credit card numbers are used in applications where a user is able to purchase goods and/or services.<paragraph></paragraph>A credit card number is a sensitive piece of information and should be handled as such. Cyber-criminals will use various methods to attempt to compromise credit card information that can then be used for fraudulent purposes.<paragraph></paragraph>Through the use of regular expressions and CC number format validation, It was possible to discover a credit card number located within the affected page.</paragraph>", "poc": null, "remediation": "<paragraph>Initially, the credit card number within the response should be checked to ensure its validity, as it is possible that the regular expression has matched on a similar number with no relation to a real credit card.<paragraph></paragraph>If the response does contain a valid credit card number, then all efforts should be taken to remove or further protect this information. This can be achieved by removing the credit card number altogether, or by masking the number so that only the last few digits are present within the response. (eg. _**********123_).<paragraph></paragraph>Additionally, credit card numbers should not be stored by the application, unless the organisation also complies with other security controls as outlined in the Payment Card Industry Data Security Standard (PCI- DSS).</paragraph>", "references": "<paragraph>VulnDB: https://github.com/vulndb/data</paragraph><paragraph>http://en.wikipedia.org/wiki/Luhn_algorithm</paragraph><paragraph>http://en.wikipedia.org/wiki/Bank_card_number</paragraph>", "approved": true, "risk": 3, "affected_hosts": null, "av": null, "ac": null, "au": null, "c": null, "i": null, "a": null, "e": null, "rl": null, "rc": null, "cdp": null, "td": null, "cr": null, "ir": null, "ar": null, "cvss_base": null, "cvss_impact": null, "cvss_exploitability": null, "cvss_temporal": null, "cvss_environmental": null, "cvss_modified_impact": null, "cvss_total": null, "ease": null}]