[{"id": 188, "title": "Exposure of Private Information (&amp;#x27;Privacy Violation&amp;#x27;)", "damage": 1, "reproducability": 1, "exploitability": 1, "affected_users": 1, "discoverability": 1, "dread_total": 1, "effort": null, "type": "Imported", "overview": "Mishandling private information, such as customer passwords or Social Security numbers, can compromise user privacy and is often illegal. An exposure of private information does not necessarily prevent the software from working properly, and in fact it might be intended by the developer, but it can still be undesirable (or explicitly prohibited by law) for the people who are associated with this private information. Privacy violations may occur when: Private user information enters the program. The data is written to an external location, such as the console, file system, or network. Private data can enter a program in a variety of ways: Directly from the user in the form of a password or personal information Accessed from a database or other data store by the application Indirectly from a partner or other third party Some types of private information include: Government identifiers, such as Social Security Numbers Contact information, such as home addresses and telephone numbers Geographic location - where the user is (or was) Employment history Financial data - such as credit card numbers, salary, bank accounts, and debts Pictures, video, or audio Behavioral patterns - such as web surfing history, when certain activities are performed, etc. Relationships (and types of relationships) with others - family, friends, contacts, etc. Communications - e-mail addresses, private e-mail messages, SMS text messages, chat logs, etc. Health - medical conditions, insurance status, prescription records Credentials, such as passwords, which can be used to access other information. Some of this information may be characterized as PII (Personally Identifiable Information), Protected Health Information (PHI), etc. Categories of private information may overlap or vary based on the intended usage or the policies and practices of a particular industry. Depending on its location, the type of business it conducts, and the nature of any private data it handles, an organization may be required to comply with one or more of the following federal and state regulations: - Safe Harbor Privacy Framework [REF-340] - Gramm-Leach Bliley Act (GLBA) [REF-341] - Health Insurance Portability and Accountability Act (HIPAA) [REF-342] - California SB-1386 [REF-343]. Sometimes data that is not labeled as private can have a privacy implication in a different context. For example, student identification numbers are usually not considered private because there is no explicit and publicly-available mapping to an individual student&amp;#x27;s personal information. However, if a school generates identification numbers based on student social security numbers, then the identification numbers should be considered private. Security and privacy concerns often seem to compete with each other. From a security perspective, all important operations should be recorded so that any anomalous activity can later be identified. However, when private data is involved, this practice can in fact create risk. Although there are many ways in which private data can be handled unsafely, a common risk stems from misplaced trust. Programmers often trust the operating environment in which a program runs, and therefore believe that it is acceptable store private information on the file system, in the registry, or in other locally-controlled resources. However, even if access to certain resources is restricted, this does not guarantee that the individuals who do have access can be trusted.", "poc": null, "remediation": "", "references": null, "approved": true, "risk": 1, "affected_hosts": null, "av": null, "ac": null, "au": null, "c": null, "i": null, "a": null, "e": null, "rl": null, "rc": null, "cdp": null, "td": null, "cr": null, "ir": null, "ar": null, "cvss_base": null, "cvss_impact": null, "cvss_exploitability": null, "cvss_temporal": null, "cvss_environmental": null, "cvss_modified_impact": null, "cvss_total": null, "ease": null, "c2_vs": null, "attack_vector": null, "attack_complexity": null, "privileges_required": null, "user_interaction": null, "scope_cvss": null, "confidentiality": null, "integrity": null, "availability": null, "exploit_maturity": null, "remeditation_level": null, "report_confidence": null, "confidentiality_requirement": null, "integrity_requirement": null, "availability_requirement": null, "mod_attack_vector": null, "mod_attack_complexity": null, "mod_privileges_required": null, "mod_user_interaction": null, "mod_scope": null, "mod_confidentiality": null, "mod_integrity": null, "mod_availability": null, "cvss_base_score": null, "cvss_impact_score": null, "cvss_mod_impact_score": null, "c3_vs": null, "severity": null, "likelihood": null, "severity_rationale": null, "likelihood_rationale": null, "nist_impact": null, "nist_likelihood": null, "nist800_total": null, "impact_val": null, "likelihood_val": null, "nist_rating": null, "language": null}]