[{"id": 44, "title": "Missing 'Strict-Transport-Security' header", "damage": 1, "reproducability": 1, "exploitability": 1, "affected_users": 1, "discoverability": 1, "dread_total": 5, "effort": null, "type": "Imported", "overview": "<paragraph>The HTTP protocol by itself is clear text, meaning that any data that is transmitted via HTTP can be captured and the contents viewed. To keep data private and prevent it from being intercepted, HTTP is often tunnelled through either Secure Sockets Layer (SSL) or Transport Layer Security (TLS). When either of these encryption standards are used, it is referred to as HTTPS.<paragraph></paragraph>HTTP Strict Transport Security (HSTS) is an optional response header that can be configured on the server to instruct the browser to only communicate via HTTPS. This will be enforced by the browser even if the user requests a HTTP resource on the same server.<paragraph></paragraph>Cyber-criminals will often attempt to compromise sensitive information passed from the client to the server using HTTP. This can be conducted via various Man-in-The-Middle (MiTM) attacks or through network packet captures.<paragraph></paragraph>The tool discovered that the affected application is using HTTPS however does not use the HSTS header.</paragraph>", "poc": null, "remediation": "<paragraph>Depending on the framework being used the implementation methods will vary, however it is advised that the 'Strict-Transport-Security' header be configured on the server.<paragraph></paragraph>One of the options for this header is 'max-age', which is a representation (in milliseconds) determining the time in which the client's browser will adhere to the header policy.<paragraph></paragraph>Depending on the environment and the application this time period could be from as low as minutes to as long as days.</paragraph>", "references": "<paragraph>VulnDB: https://github.com/vulndb/data</paragraph><paragraph>http://en.wikipedia.org/wiki/HTTP_Strict_Transport_Security</paragraph><paragraph>https://www.owasp.org/index.php/HTTP_Strict_Transport_Security</paragraph>", "approved": true, "risk": 3, "affected_hosts": null, "av": null, "ac": null, "au": null, "c": null, "i": null, "a": null, "e": null, "rl": null, "rc": null, "cdp": null, "td": null, "cr": null, "ir": null, "ar": null, "cvss_base": null, "cvss_impact": null, "cvss_exploitability": null, "cvss_temporal": null, "cvss_environmental": null, "cvss_modified_impact": null, "cvss_total": null, "ease": null}]