[{"id": 40, "title": "Operating system command injection", "damage": 1, "reproducability": 1, "exploitability": 1, "affected_users": 1, "discoverability": 1, "dread_total": 5, "effort": null, "type": "Imported", "overview": "<paragraph>To perform specific actions from within a web application, it is occasionally required to run Operating System commands and have the output of these commands captured by the web application and returned to the client.<paragraph></paragraph>OS command injection occurs when user supplied input is inserted into one of these commands without proper sanitisation and is then executed by the server.<paragraph></paragraph>Cyber-criminals will abuse this weakness to perform their own arbitrary commands on the server. This can include everything from simple 'ping' commands to map the internal network, to obtaining full control of the server. <paragraph></paragraph> It was possible to inject and verify the execution of specific Operating System commands which indicates that proper input sanitisation is not occurring.</paragraph>", "poc": null, "remediation": "<paragraph>It is recommended that untrusted data is never used to form a command to be executed by the OS.<paragraph></paragraph>To validate data, the application should ensure that the supplied value contains only the characters that are required to perform the required action.<paragraph></paragraph>For example, where the form field expects an IP address, only numbers and periods should be accepted. Additionally, all control operators ('&', '&&', '|', '||', '$', '\\', '#') should be explicitly denied and never accepted as valid input by the server.</paragraph>", "references": "<paragraph>VulnDB: https://github.com/vulndb/data</paragraph><paragraph>http://projects.webappsec.org/w/page/13246950/OS%20Commanding</paragraph><paragraph>https://www.owasp.org/index.php/OS_Command_Injection</paragraph>", "approved": true, "risk": 4, "affected_hosts": null, "av": null, "ac": null, "au": null, "c": null, "i": null, "a": null, "e": null, "rl": null, "rc": null, "cdp": null, "td": null, "cr": null, "ir": null, "ar": null, "cvss_base": null, "cvss_impact": null, "cvss_exploitability": null, "cvss_temporal": null, "cvss_environmental": null, "cvss_modified_impact": null, "cvss_total": null, "ease": null}]