[{"id": 730, "title": "Uncontrolled Resource Consumption (&amp;#x27;Resource Exhaustion&amp;#x27;)", "damage": 1, "reproducability": 1, "exploitability": 1, "affected_users": 1, "discoverability": 1, "dread_total": 1, "effort": null, "type": "Imported", "overview": "Limited resources include memory, file system storage, database connection pool entries, or CPU. If an attacker can trigger the allocation of these limited resources, but the number or size of the resources is not controlled, then the attacker could cause a denial of service that consumes all available resources. This would prevent valid users from accessing the software, and it could potentially have an impact on the surrounding environment. For example, a memory exhaustion attack against an application could slow down the application as well as its host operating system. Resource exhaustion problems have at least two common causes: Error conditions and other exceptional circumstances Confusion over which part of the program is responsible for releasing the resource", "poc": null, "remediation": "::PHASE:Architecture and Design:STRATEGY::EFFECTIVENESS::DESCRIPTION:Design throttling mechanisms into the system architecture. The best protection is to limit the amount of resources that an unauthorized user can cause to be expended. A strong authentication and access control model will help prevent such attacks from occurring in the first place. The login application should be protected against DoS attacks as much as possible. Limiting the database access, perhaps by caching result sets, can help minimize the resources expended. To further limit the potential for a DoS attack, consider tracking the rate of requests received from users and blocking requests that exceed a defined rate threshold.::PHASE:Architecture and Design:STRATEGY::EFFECTIVENESS::DESCRIPTION:Mitigation of resource exhaustion attacks requires that the target system either: recognizes the attack and denies that user further access for a given amount of time, or uniformly throttles all requests in order to make it more difficult to consume resources more quickly than they can again be freed. The first of these solutions is an issue in itself though, since it may allow attackers to prevent the use of the system by a particular valid user. If the attacker impersonates the valid user, they may be able to prevent the user from accessing the server in question. The second solution is simply difficult to effectively institute -- and even when properly done, it does not provide a full solution. It simply makes the attack require more resources on the part of the attacker.::PHASE:Architecture and Design:STRATEGY::EFFECTIVENESS::DESCRIPTION:Ensure that protocols have specific limits of scale placed on them.::PHASE:Implementation:STRATEGY::EFFECTIVENESS::DESCRIPTION:Ensure that all failures in resource allocation place the system into a safe posture.::", "references": null, "approved": true, "risk": 1, "affected_hosts": null, "av": null, "ac": null, "au": null, "c": null, "i": null, "a": null, "e": null, "rl": null, "rc": null, "cdp": null, "td": null, "cr": null, "ir": null, "ar": null, "cvss_base": null, "cvss_impact": null, "cvss_exploitability": null, "cvss_temporal": null, "cvss_environmental": null, "cvss_modified_impact": null, "cvss_total": null, "ease": null, "c2_vs": null, "attack_vector": null, "attack_complexity": null, "privileges_required": null, "user_interaction": null, "scope_cvss": null, "confidentiality": null, "integrity": null, "availability": null, "exploit_maturity": null, "remeditation_level": null, "report_confidence": null, "confidentiality_requirement": null, "integrity_requirement": null, "availability_requirement": null, "mod_attack_vector": null, "mod_attack_complexity": null, "mod_privileges_required": null, "mod_user_interaction": null, "mod_scope": null, "mod_confidentiality": null, "mod_integrity": null, "mod_availability": null, "cvss_base_score": null, "cvss_impact_score": null, "cvss_mod_impact_score": null, "c3_vs": null, "severity": null, "likelihood": null, "severity_rationale": null, "likelihood_rationale": null, "nist_impact": null, "nist_likelihood": null, "nist800_total": null, "impact_val": null, "likelihood_val": null, "nist_rating": null, "language": null}]