[{"id": 24, "title": "WebDAV", "damage": 1, "reproducability": 1, "exploitability": 1, "affected_users": 1, "discoverability": 1, "dread_total": 5, "effort": null, "type": "Imported", "overview": "<paragraph>Web Distributed Authoring and Versioning (WebDAV) is a facility that enables basic file management (reading and writing) to a web server. It essentially allows the webserver to be mounted by the client as a traditional file system allowing users a very simplistic means to access it as they would any other medium or network share.<paragraph></paragraph>If discovered, attackers will attempt to harvest information from the WebDAV enabled directories, or even upload malicious files that could then be used to compromise the server.<paragraph></paragraph>The tool discovered that the affected page allows WebDAV access. This was discovered as the server allowed several specific methods that are specific to WebDAV ('PROPFIND', 'PROPPATCH', etc.), however, further testing should be conducted on the WebDAV component specifically as the tool does support this feature.</paragraph>", "poc": null, "remediation": "<paragraph>Identification of the requirement to run a WebDAV server should be considered. If it is not required then it should be disabled. However, if it is required to meet the application functionality, then it should be protected by SSL/TLS as well as the implementation of a strong authentication mechanism.</paragraph>", "references": "<paragraph>VulnDB: https://github.com/vulndb/data</paragraph><paragraph>http://www.webdav.org/specs/rfc4918.html</paragraph><paragraph>http://en.wikipedia.org/wiki/WebDAV</paragraph>", "approved": true, "risk": 1, "affected_hosts": null, "av": null, "ac": null, "au": null, "c": null, "i": null, "a": null, "e": null, "rl": null, "rc": null, "cdp": null, "td": null, "cr": null, "ir": null, "ar": null, "cvss_base": null, "cvss_impact": null, "cvss_exploitability": null, "cvss_temporal": null, "cvss_environmental": null, "cvss_modified_impact": null, "cvss_total": null, "ease": null}]